<script setup>
import { RouterLink, RouterView } from 'vue-router'

</script>

<template>
  <RouterView />
</template>

<style scoped>

</style>



<!-- 1.根据视频效果搭建路由（登录页，主页面和内部的子路由）（10分）；
2.模拟出登录验证的过程，要根据输入的用户名和密码判断是否可登录，用户名输入：admin密码输入：123 ，验证成功才可登录（10分）；
3.实现登录拦截功能，没有登录不可进入首页（10分）；
4.第一次进入主页面的时重定向到资金组成这个路由（10分）；
5.主页面的内的二级路由可以正确的切换，刷新页面正常显示高亮和标题（10分）
6.点击侧边栏切换的时候，右侧的tab项可以同步显示（10分）
7.点击tab页的时候，侧边栏也可以同步显示（10分）
8.侧边栏和tab均能以高亮的形式展示出当前展示的路由，刷新页面正常显示高亮和标题（10分）；
9.Tab项关完后，跳转到登录页（10分）；
10.主页面的右上角，正确显示用户名称，点击退出按钮的时候能回到登录页（10分）； -->

